Revit 2026 API

# DetailElementOrderUtilsGetDrawOrderForDetails Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ElementId> GetDrawOrderForDetails(
	View view,
	ISet<ElementId> detailIdsToSort
)
```
```vb
Public Shared Function GetDrawOrderForDetails (
	view As View,
	detailIdsToSort As ISet(Of ElementId)
) As IList(Of ElementId)
```
```cpp
public:
static IList<ElementId^>^ GetDrawOrderForDetails(
	View^ view,
	ISet<ElementId^>^ detailIdsToSort
)
```
```fsharp
static member GetDrawOrderForDetails :
        view : View *
        detailIdsToSort : ISet<ElementId> -> IList<ElementId>
```

#### Parameters

view View

detailIdsToSort ISetElementId

#### Return Value

IListElementId

#### Reference

DetailElementOrderUtils Class

Autodesk.Revit.DB Namespace